{"tag":"housing","message_eng":"I'm facing a housing crisis. I was evicted from a rented room in a shared house without any notice and no alternative accommodation. I need help with temporary housing and financial support. I need to find a new place to live for myself and my children. I need help with paperwork and getting familiar with the Finnish language. I'm very worried about my future and the future of my children. Please help me as soon as possible."}
{"tag":"migri","message_eng":"I have a question regarding the language proficiency test requirements for a permanent residence permit in Finland. I've been living in Finland for a few months now, but I need to get a permanent residence permit. I tried to find information about the language proficiency test requirements, but I couldn't find clear data. Can I get information about the language proficiency level I need to achieve to pass the language test? I'm also interested in knowing if there's any help available to prepare for the language test. I'm very grateful for any assistance."}
{"tag":"alien's passport","message_eng":"I'm facing a problem with obtaining a new Ukrainian passport after arriving in Finland. During my trip to a family reunion, I lost my passport. Now I'm being refused a new passport without proof of address. I've already contacted the Ukrainian consulate, but they're refusing to issue me a new passport, saying I need to confirm my place of residence in Finland. But I've just arrived and haven't found a place to live yet. I'm very worried that I'll be refused a passport and I'll be left without documents. Please help me find a solution to this problem."}
{"tag":"family","message_eng":"I'm writing from Ukraine, but I'm currently living in Finland with my 3-year-old daughter. My ex-husband left me before she was born and hasn't paid any child support. My mother, who lives in Finland, is helping me, but I'm very worried that I won't be able to get help from my ex-husband. He refuses to communicate with me and refuses to pay. I've already contacted Finnish authorities, but I need help with preparing documents and filing a lawsuit. Can you help me get child support from my ex-husband?"}
{"tag":"education","message_eng":"I'm writing to you with a very serious problem. My family, my wife, and our 5-year-old daughter arrived in Finland a few weeks ago. We're very grateful for the opportunity to find refuge in your country. However, we're now facing a very difficult situation. Our daughter really wants to learn Finnish language and culture, but it's very hard for us to find schools that accept Ukrainian children without documents. We've already contacted various government agencies, but no one has helped us. It's very important for me that my daughter learns with other children, but now she feels very lonely and isolated. We would be very grateful if you could help us find a solution to this problem."}
{"tag":"migri","message_eng":"I've encountered a problem with my residence permit card during a move. I've lost it and can't find it anywhere, even don't remember where I left it. Is it possible to get a new residence permit without it? How do I need to contact the authorities to report the loss of the permit? I'm really worried about this issue, as I've been unable to receive my pension for several days, which I'm entitled to for my previous work in Ukraine. I would be very grateful for your help."}
{"tag":"physical violence","message_eng":"I'm writing from Ukraine, but I'm currently living in Vaasa, Finland. My business is being bullied by a local businessman who's sending me threatening messages and trying to sabotage my business through online reviews. He even created a fake page on social media spreading false information about me and my company. I've already reported this to the police, but they're doing nothing. I'm extremely worried about my future and my family's future. I'm asking for help in protecting my company and my personal identity. Can you help me find protection and defend me against these harassments?"}
{"tag":"special needs","message_eng":"I'm writing to you from Ukraine, where I fled the war. Now I'm living in Finland, but it's very hard for me to adapt to the new language, culture, and living environment. I have anxiety disorder, but it's hard for me to find help and support here. I need help with language to find a job and integrate into society. I also need psychological support to cope with stress and anxiety. I'm very afraid that I won't be able to find my place in this new world. Please help me."}
{"tag":"property","message_eng":"I'm facing problems with my Finnish bank account. It's been frozen due to suspicion of money laundering related to my Ukrainian business. I need to get help quickly to restore access to my funds. I've already contacted the Finnish police and bank services, but they say it's a very long process. I need your help to quickly restore my account and continue my life in Finland. I'm very worried about this situation and very grateful for any assistance."}
{"tag":"birth registration and passport","message_eng":"I have refugee status in Finland, but I still haven't been able to obtain a Finnish ID card and health insurance. In a few weeks, I'm expecting a baby, and it's crucial for me to get proper medical care during pregnancy and childbirth. Can I get help with obtaining an ID card and health insurance so I can visit doctors and get proper care during pregnancy?"}
{"tag":"legalisation of the documents","message_eng":"I'm experiencing problems with my documents after a police raid. During the search, they took all my documents, including the apostille. Now I need help replacing these documents. I need help getting new documents, including an apostille, so I can continue my life in Finland. I've already contacted the police, but they can't help me. I really hope you can help me."}
{"tag":"work","message_eng":"I'm facing difficulties with my employer after they offered me a contract change proposal. They're requiring me to sign a new contract with more responsibilities, but without an increase in salary. I need to change my contract to continue working for the company, but they refuse to change the terms. I've already approached them several times, but they refuse to listen to me. I'm very concerned about this situation, as I need to secure my future and that of my family. I'm seeking help in resolving this issue."}
{"tag":"alimony","message_eng":"I'm in a very difficult situation. I'm a Ukrainian refugee who arrived in Finland with my 8-year-old child. My son needs medical treatment, but I'm having a hard time getting him registered for free healthcare services. I don't have a permanent address, so I'm being denied registration. I've already reached out to various organizations, but no one has been able to help me. I really need your help. Please, help me get my son registered. I'm very grateful for any assistance."}
{"tag":"housing","message_eng":"I'm facing a huge problem finding a place to live in Finland. I've been searching for weeks, but nowhere can I find anything that matches my financial possibilities. All rental agencies require a credit history, but I'm being rejected for a loan due to lack of work experience in the country. The rental agency I approached for help refused me even after I explained my situation with the war in Ukraine and that I lost my job and home. They say no one is obligated to help me. I'm extremely worried about my future and the future of my children. Is there any possibility of getting help with obtaining a loan or finding another way to get a place to live?"}
{"tag":"taxes in Finland","message_eng":"I'm experiencing issues accessing my online banking in Finland due to restrictions on Ukrainian-issued bank cards. I need help to restore access to my funds to ensure I can provide for my family's food and housing. My husband works, but earns very little to cover all necessary expenses. I need assistance with setting up a new bank card or restoring access to my existing one. I would be extremely grateful for any help."}
