{"tag":"access to medical services","message_eng":"I recently underwent surgery to remove my appendix, but the hospital is refusing to reimburse me for my medical expenses, claiming they don't have a contract with my Ukrainian health insurance provider. I need help quickly as my money is running out. Can you assist me in getting compensation for my treatment? I've already contacted the hospital, but they're refusing to help. Is there an organization that can help me get compensation?"}
{"tag":"access to medical services","message_eng":"I have chronic diabetes and it's crucial for me to get my treatment. But I'm having a hard time navigating the Finnish healthcare system. I've been trying to get my medication for several months now, but I'm being denied, saying I don't speak Finnish well enough. I'm struggling to understand why I'm being denied treatment when I've been living with diabetes for years. I'm really worried about my health and I'm asking for your help. Can you assist me in getting my medication and understanding the Finnish healthcare system?"}
{"tag":"alien's passport","message_eng":"I'm facing a problem with obtaining a new Ukrainian passport after arriving in Finland. During my trip to a family reunion, I lost my passport. Now I'm being refused a new passport without proof of address. I've already contacted the Ukrainian consulate, but they're refusing to issue me a new passport, saying I need to confirm my place of residence in Finland. But I've just arrived and haven't found a place to live yet. I'm very worried that I'll be refused a passport and I'll be left without documents. Please help me find a solution to this problem."}
{"tag":"alimony","message_eng":"I'm in a very difficult situation. I'm a Ukrainian refugee who arrived in Finland with my 8-year-old child. My son needs medical treatment, but I'm having a hard time getting him registered for free healthcare services. I don't have a permanent address, so I'm being denied registration. I've already reached out to various organizations, but no one has been able to help me. I really need your help. Please, help me get my son registered. I'm very grateful for any assistance."}
{"tag":"animals","message_eng":"I'm writing from Ukraine, but I'm currently a refugee in Finland. It's very hard for me to take care of my pets - a dog and two cats. My small apartment doesn't have a yard where they can freely go out. They're suffering from lack of physical activity and socialization. I need help organizing pet care, for example, finding a special organization that could help me with this. I also need help getting the necessary documents to register my pets in Finland. I'm very grateful for any help."}
{"tag":"animals","message_eng":"I'm having huge problems getting a permit to keep my two pet rabbits. I've been trying to submit all the necessary documents for weeks, but no one is helping me anywhere. The Finnish bureaucracy system is very complicated, I don't understand why I need to submit so many documents just to get a permit to keep my pets. My rabbits are my only friends after I fled Ukraine, I really need to keep them. Please help me get a permit to keep my rabbits."}
{"tag":"arriving to Finland","message_eng":"I'm having problems because I arrived in Finland in the evening in winter time and found out that the address of my booked accommodation is in a remote area with no public transportation. I need help to find a way to get to my place of residence. I need help with organizing transportation or finding another way to get to my place of residence. I also need help with registering with the local police and getting the necessary documents. I'm very worried about my situation and very grateful for any help."}
{"tag":"arriving to Finland","message_eng":"I have a job offer in Finland, but I'm really worried about the terms of the employment contract. I don't understand how tax deductions and social benefits will work. Can you help me figure out all these questions? I haven't worked for several weeks now, so it's really important for me to get a job as soon as possible. I also need help with getting the necessary documents for social assistance and other rights. Do you have experience working with Ukrainian refugees and can help me with adapting to life in Finland?"}
{"tag":"birth registration and passport","message_eng":"I'm writing from Ukraine, but I'm currently living in Finland. I'm 20 weeks pregnant, but it's really hard for me to find affordable maternity care and language support in our local area. I need help finding a doctor who can assist me during pregnancy and childbirth. I also need language support to communicate better with doctors and get the necessary help. It's really important for me to ensure a good future for my child, but it's really hard for me to do it without help. I would be very grateful for any assistance."}
{"tag":"birth registration and passport","message_eng":"I have refugee status in Finland, but I still haven't been able to obtain a Finnish ID card and health insurance. In a few weeks, I'm expecting a baby, and it's crucial for me to get proper medical care during pregnancy and childbirth. Can I get help with obtaining an ID card and health insurance so I can visit doctors and get proper care during pregnancy?"}
{"tag":"car issue","message_eng":"I have a problem with a fine for parking in a restricted zone. I was issued a residence permit in Finland, but I'm still using it. As a result, I was stopped by the police and fined for parking in a restricted zone. I tried to pay the fine, but I was refused, saying I need to go to court. I don't know how to do this and if I'll be able to get help. I need help with appealing this decision. Can you help me with this?"}
{"tag":"car issue","message_eng":"I'm having trouble registering a used car I bought in Finland due to incomplete ownership documents from a Ukrainian seller. I've already contacted various organizations, but no one has been able to help me. I need assistance with preparing the necessary documents or connecting with an expert who could help me with this issue. I've been living in Finland for almost a year now, but I still haven't been able to obtain citizenship, so it's very important for me to have access to a car for trips to the hospital and other necessary places. I would be very grateful for any help."}
{"tag":"car issue","message_eng":"I'm facing huge problems with registering my car in Finland. As a single mother, I have to work to provide for my family, but the Finnish credit history system is very complicated for me. I don't have any credit history in Finland, so I'm being refused car registration. Additionally, I'm being informed about previous traffic fines in Ukraine that I couldn't pay earlier. I'm very worried that I might lose my car, which I need for work and living with my children. I've asked for help in various places, but nobody has been able to assist me. Can you help me with car registration or find a solution for my problems?"}
{"tag":"car issue","message_eng":"I have a serious problem with getting help. I fled Ukraine due to the war and I'm currently in Finland. I have epilepsy and I need special help for my treatment. But I was denied the right to drive because my medical certificate expired three years ago. Now it's hard for me to get to the hospital where I receive treatment and I feel very lonely. I asked for help from the local authorities, but they refused. I really asked for help from you, as I don't know who else could help me. I really hope you can help me."}
{"tag":"car issue","message_eng":"You can help me with the issue of obtaining joint ownership of our car. My husband and I moved to Finland after the war in Ukraine. We have an old agreement on joint ownership of the car, which was signed in our country before the war. But it's outdated and doesn't meet the requirements of Finnish authorities. We can't get a new agreement because all our documents were lost during the war. We really need help with this issue, as our car is our main means of transportation. We would be very grateful for any assistance."}
{"tag":"child protection","message_eng":"We are very grateful for the help you provide to Ukrainian refugees in Finland. Our 7-year-old son has been living with our foster parents in Finland for almost a year now. But for the past few months, he has been suffering from bullying by other children at school. They mock his Ukrainian accent and clothes. He is suffering a lot from this, and we don't know how to help him. He has already started refusing to go to school because it hurts him so much. We are very afraid that this could lead to serious problems in the future. Can you help us find a specialist who could help our son with this? Are there any programs or services that could help him integrate into the Finnish school and society?"}
{"tag":"child protection","message_eng":"You know what's happening to me? I've been having a hard time finding information about my child who was separated from me during the war. Now it's living with a temporary foster family in Finland, but I don't know if it's okay there or not. I've already reached out to various organizations, but no one can help me. I need your help. Please check the information about the child named [child's name] and let me know its status. I'm very worried about it."}
{"tag":"child protection","message_eng":"I'm writing from Ukraine, where I was forced to leave my city due to the war. My father works, but it's very hard for me to find a school that meets my educational needs. I have special needs that were previously met in Ukraine, but nowhere here can help me. I've already approached several schools, but nowhere can provide me with proper education. It's very important for me to continue my studies, but I don't know how much longer I'll be able to. Please help me find a school that can meet my educational needs. I'm very grateful for any help."}
{"tag":"education","message_eng":"I'm a mother of three, working part-time, but I can't afford daycare for the youngest. Now I've been refused to send my 10-year-old to summer school in Helsinki. I need help with paying for daycare and finding a place for my child in summer school. It's very important for me to ensure my children's education and development even in this difficult situation. I would be very grateful for any help."}
{"tag":"education","message_eng":"I'm writing to you with a very serious problem. My family, my wife, and our 5-year-old daughter arrived in Finland a few weeks ago. We're very grateful for the opportunity to find refuge in your country. However, we're now facing a very difficult situation. Our daughter really wants to learn Finnish language and culture, but it's very hard for us to find schools that accept Ukrainian children without documents. We've already contacted various government agencies, but no one has helped us. It's very important for me that my daughter learns with other children, but now she feels very lonely and isolated. We would be very grateful if you could help us find a solution to this problem."}
{"tag":"education","message_eng":"I have a big problem with getting help with English language courses for adults in Eastern Finland. As a Ukrainian citizen, I was forced to leave my parents' home in Kyiv due to the war and find refuge in Finland. I don't have the possibility to attend English language courses in the city of Joensuu, where I currently live, because my work obligations require me to work from home and have constant access to the internet. The English language courses are only held on certain days of the week, and my work obligations do not allow me to attend them. I am very afraid that if I don't learn English, it will be very difficult for me to integrate into Finnish society and find a job. I would be very grateful if you could help me find a solution to this problem or advise me on how I can continue learning English."}
{"tag":"entrepreneurship","message_eng":"I have a business idea to create online courses for children, but I'm not sure what licenses and permits I need to obtain in Finland. I need information on the necessary documents and procedures for registering a business. I also need help with preparing the necessary documents to obtain refugee status, which would allow me to work in the country. I've been living in Finland for several months now, but I still don't have refugee status, and I'm unable to get a job. I would be very grateful for help with this matter."}
{"tag":"family","message_eng":"I'm writing from Ukraine, but I'm currently living in Finland with my children. My husband has been absent for 5 years, but we signed an agreement in Russia to pay child support. Now he refuses to fulfill his obligations, despite us reaching out to him multiple times to ask for help. My children are suffering greatly from the lack of financial support, and I'm extremely worried about their future. Can you help me get assistance from the Finnish government or other organizations that might be able to help me get financial support from my husband?"}
{"tag":"family","message_eng":"I'm writing from Ukraine, but I'm currently living in Finland with my 3-year-old daughter. My ex-husband left me before she was born and hasn't paid any child support. My mother, who lives in Finland, is helping me, but I'm very worried that I won't be able to get help from my ex-husband. He refuses to communicate with me and refuses to pay. I've already contacted Finnish authorities, but I need help with preparing documents and filing a lawsuit. Can you help me get child support from my ex-husband?"}
{"tag":"family","message_eng":"I'm in a very difficult situation. My husband and I were separated a month ago during the Finnish asylum process. I'm pregnant, but he's missing, and I have no information about his whereabouts. It's very important for me to find him, as he's my husband and the father of our unborn child. I've already contacted the Finnish authorities, but nothing has come of it. I'm asking for your help, as I don't know who else could assist me. I would be very grateful for any information about his whereabouts or help in re-establishing contact with him."}
{"tag":"guardiansip","message_eng":"I'm writing from Ukraine, but I'm currently a refugee in Finland. My mother has dementia and needs constant care. Her Ukrainian caregivers help me, but it's crucial for me to find a Finnish organization that can communicate with them. I need them to be able to communicate with each other so my mother can receive proper care. But so far, no organization has responded to me. It's very hard for me to do this on my own. I would be extremely grateful if you could help me."}
{"tag":"heritage","message_eng":"Can you help me with registering the inheritance after my father's death? I'm the sole heir, but the Finnish system is very complicated for me. My father owned property in Ukraine, but I don't know how to transfer it to my name. I've already contacted the Finnish police and got some information, but I need help with preparing documents and communicating with Ukrainian authorities. I'm very worried that I might lose the inheritance if I don't manage to register it on time. Please help me find a way to resolve this issue."}
{"tag":"housing","message_eng":"You can help me with a problem in my shared apartment. My neighbor is violating the rules by keeping a pet, which causes allergic reactions and other issues. I've already reported this to the building administration, but they're doing nothing. I need help to get him to remove his cat or at least follow the rules. I'm already feeling very uncomfortable in my own home. I would be very grateful for any assistance."}
{"tag":"housing","message_eng":"I'm facing a housing crisis. I was evicted from a rented room in a shared house without any notice and no alternative accommodation. I need help with temporary housing and financial support. I need to find a new place to live for myself and my children. I need help with paperwork and getting familiar with the Finnish language. I'm very worried about my future and the future of my children. Please help me as soon as possible."}
{"tag":"housing","message_eng":"I have a serious problem. I received a letter from the company that owns my apartment, that they are selling the building and I need to vacate the apartment by the end of the month. But no assistance with finding a new place is provided. I need to find a new home for my family, but I have nowhere to take the money for rent. I need help with organizing the move and getting in touch with organizations that can help me with this. I would be very grateful for any assistance."}
{"tag":"housing","message_eng":"I'm facing a huge problem finding a place to live in Finland. I've been searching for weeks, but nowhere can I find anything that matches my financial possibilities. All rental agencies require a credit history, but I'm being rejected for a loan due to lack of work experience in the country. The rental agency I approached for help refused me even after I explained my situation with the war in Ukraine and that I lost my job and home. They say no one is obligated to help me. I'm extremely worried about my future and the future of my children. Is there any possibility of getting help with obtaining a loan or finding another way to get a place to live?"}
{"tag":"kids taken away","message_eng":"We are a family of four, including our 12-year-old son with autism. Our temporary residence permit is expiring, and the wait times for family reunification are extremely long. We've been waiting for months without knowing what's next. My son is very anxious about the future, he's already started feeling fear and distress. He needs special help and support, which he receives in the Finnish school. But if we leave the country, he'll lose this support. I'm very worried about our family's future. Can you help us get the necessary assistance and protect our family?"}
{"tag":"kids taken away","message_eng":"I'm writing from Ukraine, but I'm currently in Finland as a refugee. My husband has submitted an asylum application, but his status is still pending. I'm pregnant and expecting a baby. If I'm denied asylum and forced to return to Ukraine, I'm extremely worried about being separated from my newborn. I don't have the money to travel to Ukraine to visit my child, and I'm unsure how to secure her future. I would be incredibly grateful for any help in this situation."}
{"tag":"kids taken away","message_eng":"I'm writing from Ukraine, but I'm currently in Finland as a refugee. My husband has submitted an asylum application, but his status is still pending. I'm pregnant and expecting a baby. If I'm denied asylum and forced to return to Ukraine, I'm extremely worried about being separated from my newborn. I don't have the money to travel to Ukraine to visit my child, and I'm unsure how to secure her future. I would be incredibly grateful for any help in this situation."}
{"tag":"legalisation of the documents","message_eng":"I'm experiencing problems with my documents after a police raid. During the search, they took all my documents, including the apostille. Now I need help replacing these documents. I need help getting new documents, including an apostille, so I can continue my life in Finland. I've already contacted the police, but they can't help me. I really hope you can help me."}
{"tag":"migri","message_eng":"I've encountered a problem with my residence permit card during a move. I've lost it and can't find it anywhere, even don't remember where I left it. Is it possible to get a new residence permit without it? How do I need to contact the authorities to report the loss of the permit? I'm really worried about this issue, as I've been unable to receive my pension for several days, which I'm entitled to for my previous work in Ukraine. I would be very grateful for your help."}
{"tag":"migri","message_eng":"I'm having trouble scheduling a visit to the migration service office. My work schedule is very tight and I'm unable to find a free time to visit the offices. Is there a possibility to get help with organizing a visit or finding an alternative way to receive services? I need help with paperwork for refugee status. I've been waiting for a few weeks now, but there's no progress. I would be very grateful for any assistance."}
{"tag":"migri","message_eng":"I have a question regarding the language proficiency test requirements for a permanent residence permit in Finland. I've been living in Finland for a few months now, but I need to get a permanent residence permit. I tried to find information about the language proficiency test requirements, but I couldn't find clear data. Can I get information about the language proficiency level I need to achieve to pass the language test? I'm also interested in knowing if there's any help available to prepare for the language test. I'm very grateful for any assistance."}
{"tag":"passport issue","message_eng":"My Finnish ID card has expired, but I'm unable to renew it due to lack of valid proof of address. As a Finnish citizen's spouse visa holder, I'm allowed to live in the country, but without an ID card, it's very hard for me to get help and services. I need assistance with getting a new address or confirming my place of residence. Moreover, I need to find a job to support myself, but without identification documents, it's very hard for me to find a job. I've asked for help from local authorities, but they refused, saying I should find a solution to this problem myself. I'm very worried about my situation and I'm asking for help."}
{"tag":"passport issue","message_eng":"I have a problem with obtaining my biometric passport. I've been waiting for several weeks, but there's no news yet. I have a flight in two days, but I don't know if I'll be able to get the passport in time. I need help with speeding up the passport process or getting a temporary replacement. I'm very worried as my visa is about to expire. I would be very grateful for any help."}
{"tag":"pension in Ukraine","message_eng":"I'm facing significant problems with receiving my pension in Ukraine. I've worked in the country for over 25 years, but my pension records are incomplete and inaccurate. As a result, I'm being denied a full pension. I need help with processing my documents and receiving my pension. I also need help finding a place to live in Finland, as I'm at risk of being evicted from my temporary accommodation. I would be very grateful for any assistance."}
{"tag":"pension in Ukraine","message_eng":"I have a problem with pension payments. My Ukrainian employer doesn't pay pension contributions, so I won't be able to receive a pension in Ukraine after retirement. I need help with getting pension benefits in Finland. I've been working in Finland for several months now, but I don't know how to get pension payments. Is it possible to get help with registering with the Finnish pension fund or receiving pension payments in Ukraine?"}
{"tag":"permanent address","message_eng":"I have an appointment letter for municipality registration, but I have no idea what documents I need to bring. I've just recently moved to Finland and still don't understand how everything works. I need help with preparing documents and understanding the registration process. I've been working for a few months now, but still haven't managed to get a Finnish phone number, so it's essential for me to complete the registration as soon as possible. I would be very grateful for any assistance."}
{"tag":"physical violence","message_eng":"I'm writing from Ukraine, but I'm currently living in Vaasa, Finland. My business is being bullied by a local businessman who's sending me threatening messages and trying to sabotage my business through online reviews. He even created a fake page on social media spreading false information about me and my company. I've already reported this to the police, but they're doing nothing. I'm extremely worried about my future and my family's future. I'm asking for help in protecting my company and my personal identity. Can you help me find protection and defend me against these harassments?"}
{"tag":"property","message_eng":"I'm facing problems with my Finnish bank account. It's been frozen due to suspicion of money laundering related to my Ukrainian business. I need to get help quickly to restore access to my funds. I've already contacted the Finnish police and bank services, but they say it's a very long process. I need your help to quickly restore my account and continue my life in Finland. I'm very worried about this situation and very grateful for any assistance."}
{"tag":"property","message_eng":"I'm experiencing problems accessing my funds after moving to Finland. During the move, I lost my Ukrainian property deed, so now I'm being denied access to my funds. I need help getting a copy of this document or obtaining financial assistance. My phone number is +38 099 123 4567. My email is [myemail@gmail.com](mailto:myemail@gmail.com). I'm extremely grateful for any help."}
{"tag":"psychological support","message_eng":"I'm writing to you from Ukraine, which I haven't seen my family in almost a year. I'm having a really hard time adjusting to life in Finland. The German language, Finnish culture, even the food - everything is new and unfamiliar. But what's really bothering me is the lack of Ukrainian community here. There are no Ukrainian shops, no Ukrainian cafes, no Ukrainian friends. I'm feeling really lonely and misunderstood. I've already reached out to various organizations, but no one has helped me. I feel like I'm completely alone in this world. Please help me find a Ukrainian community in Finland or at least advise me on how to better adapt to life here."}
{"tag":"psychological support","message_eng":"I'm writing to you from Ukraine, where I used to work as a doctor in a hospital in Kyiv. After the war started, I decided to stay with my children in the city, but later I decided to leave for Finland to continue my work in healthcare. In Finland, I work as a doctor in a hospital in Helsinki, but I feel that my qualifications and experience are not fully utilized. I feel that Finnish doctors have more opportunities for professional development than Ukrainian doctors who came here as refugees. It's very important for me to continue working in healthcare, but I need help to solve this problem. Can you help me find a job that matches my qualifications and experience?"}
{"tag":"psychological support","message_eng":"I'm writing this letter with great difficulty, because I still can't find peace after what I saw. My brother died during the war in Ukraine. His death was very brutal. He was young, had a family and children. His murder was very painful. Now I feel very lonely and can't find my place in this world. I need help to overcome this tragedy. I can't continue living like before. I need help from a psychologist to help me find peace. Also, I need help with paperwork to continue living in Finland. I beg you to help me."}
{"tag":"reception center","message_eng":"I'm having trouble adapting to the new reception center. I had to change my living arrangements, but I couldn't find anyone to help me. I feel extremely lonely and can't seem to find a job. I don't have money for food and housing. I'm very scared that I won't be able to find a place for myself in this city. Can you help me with this? Is there a possibility of getting assistance with food and housing? Is there a possibility of finding me a job? I'm begging for help."}
{"tag":"rental","message_eng":"I'm writing from Ukraine, but I'm currently living in Helsinki, Finland. I need help terminating my lease in my current accommodation as I've experienced domestic violence. I need help understanding the process of terminating the lease and finding a new place to live. I need help with paperwork and getting familiar with Finnish laws regarding protection of victims of violence. I'm very grateful for any help and advice."}
{"tag":"rental","message_eng":"Can you help me? My family's home in Ukraine was destroyed during the war, and we were forced to flee to Finland. Now we live in an apartment in Helsinki, but our landlord refuses to make necessary repairs. Our roof is collapsing, and we've been asking him to fix it for several months. But he refuses, saying we have to do all the work ourselves. We've already contacted local authorities, but nothing has changed. I really need your help. Can you help me find another landlord or help me negotiate with this man?"}
{"tag":"rental","message_eng":"Can you help me with my landlord in Finland? He refuses to accept a guaranteed payment for 6 months in lieu of a traditional rental deposit. My family's budget is extremely limited after the war, and I've already paid him 2 months in advance. Now he's demanding an additional amount that I simply can't afford. My phone number is +358 123456789. I would be extremely grateful for any assistance."}
{"tag":"return support","message_eng":"Can you help me and my family? We've been refugees in Finland for several months, but our financial situation is very difficult. We're eligible for financial assistance, but the process is taking too long. We need the money now, but it'll take us about 2 months to get it. We can't afford to go back to Ukraine until we get the financial help. Can you help us get faster financial assistance or at least help us organize the documents to get the assistance?"}
{"tag":"return support","message_eng":"I've been living in Finland for several years, but now I need to return to Ukraine. I have Finnish assets, such as a car and a bank account, but I don't know what to do with them. Can you help me withdraw money from my bank account or sell my car? I'm really worried about my future and don't know how I'll manage. I also need help with paperwork for returning to Ukraine. Can you help me with that? I'm really grateful for any assistance."}
{"tag":"return support","message_eng":"Can you help me return to Ukraine with my children? I'm very concerned about ensuring they get an education and a stable life. But I'm worried that the trip will be very hard for them. They've already lost a lot of school time in Ukraine, and I'm afraid they'll fall behind their classmates. Plus, I'm worried about their mental health after everything they've been through. Is there a possibility of getting help with preserving my children's education and supporting their mental state during our return to Ukraine?"}
{"tag":"special needs","message_eng":"I'm writing to you from Ukraine, where I fled the war. Now I'm living in Finland, but it's very hard for me to adapt to the new language, culture, and living environment. I have anxiety disorder, but it's hard for me to find help and support here. I need help with language to find a job and integrate into society. I also need psychological support to cope with stress and anxiety. I'm very afraid that I won't be able to find my place in this new world. Please help me."}
{"tag":"special needs","message_eng":"I have a chronic illness - Crohn's disease. After arriving in Finland, it was difficult for me to get proper medical care. I've been waiting for a specialist appointment for several months, but there's been no progress. I need help organizing a visit to a specialist and getting the necessary medication. It's very important for me to get proper care, as the disease is serious and can lead to serious health problems. I'm very worried about my condition and I really hope for your help."}
{"tag":"taxes in Finland","message_eng":"I'm experiencing issues accessing online tax services in Finland. During my move to a new apartment, I lost my Finnish tax card. Now I'm being denied access to my data and tax obligations. I need help getting a new tax card and restoring access to my data. Is it possible to get assistance with paperwork and communication with Finnish tax authorities?"}
{"tag":"taxes in Finland","message_eng":"I'm facing a problem with the Finnish tax authority. They're demanding proof of address for tax filing, but they're not accepting my Ukrainian rent agreement even with a translation. I've already reached out to the Finnish police and social services, but no one has been able to help me. I need help with translating documents or getting proof of address in some other way. My phone number is +358 123456789. I would be very grateful for any assistance."}
{"tag":"taxes in Finland","message_eng":"You can help me with questions about selling my real estate in Finland. As a Ukrainian citizen, I don't understand Finnish tax rules very well, especially for non-residents. I need to sell my house, but I'm worried about possible tax obligations. Can you help me understand which documents I need to submit and how to avoid any additional costs? I need your help to avoid financial problems after the war."}
{"tag":"taxes in Finland","message_eng":"I'm experiencing issues accessing my online banking in Finland due to restrictions on Ukrainian-issued bank cards. I need help to restore access to my funds to ensure I can provide for my family's food and housing. My husband works, but earns very little to cover all necessary expenses. I need assistance with setting up a new bank card or restoring access to my existing one. I would be extremely grateful for any help."}
{"tag":"taxes in Ukraine","message_eng":"I have a question about the Finnish tax system. I work full-time at a company, but I also do freelance work on the side. I need to report my additional income, but I don't understand how to do it. Do I need to register my business with the Finnish tax authorities? How do I report my additional income if I'm already working full-time at a company? I'm very worried about my financial situation and I'm very afraid of breaking Finnish tax rules. I would be very grateful for your help."}
{"tag":"taxes in Ukraine","message_eng":"I have questions about changing my status from temporary residence to permanent residence. I've been preparing to apply for permanent residence for almost a year now, but I'm not entirely clear on the tax implications. How do I change my status if I've already been paying taxes for 5 years under the temporary status? Do I need to re-register as a new citizen? Will there be any changes to my tax situation after changing my status? I need help understanding this process."}
{"tag":"temporary protection","message_eng":"I'm writing from Ukraine, but I'm currently in Finland as a refugee. I was denied temporary protection due to a technicality in my application. I need help appealing this decision. My 7-year-old daughter is very ill and needs constant medical care. She requires specialized treatment that she can't get in Ukraine. I need help getting temporary protection so I can provide for my child. I've already reached out to Finnish authorities, but I was denied. I'm very worried about my future and my child's future. Please help me."}
{"tag":"translation services","message_eng":"I have a question regarding the decision made by the Finnish Migration Agency regarding my asylum application. In their decision, they stated that I need to submit additional documents, but I am not aware of which specific documents are required. I need help with translating documents so that I can appeal the decision. I have already approached several organizations, but no one has been able to assist me. I would be very grateful if you could help me with translating documents and preparing the appeal. I need help as soon as possible, as I need to submit the appeal within the next two weeks."}
{"tag":"translation services","message_eng":"I have a problem with translating a police report about a car accident that happened in Finland. I was involved in an accident at the beginning of March, but I still haven't been able to send it to my insurance company in Ukraine. I need help translating the document so I can get compensation for the damaged items. The police report is written in Finnish, and I'm having trouble translating it myself. Can you help me with this? I would be very grateful for any assistance."}
{"tag":"travelling abroad","message_eng":"I have a very serious problem. My son, who was adopted by a Finnish citizen, has Ukrainian citizenship, but Finnish authorities do not recognize his Ukrainian birth certificate. This creates problems with his school registration. I have already appealed to Finnish authorities, but nothing has come of it. I need your help. Can you help me get recognition of my son's Ukrainian birth certificate? Do you know of any organizations or individuals who can help me? I am very worried about the future of my children and I am very hopeful for your help."}
{"tag":"travelling abroad","message_eng":"We express our deep gratitude for the help you provide to Ukrainian students who are stuck in Finland due to the war. We are very concerned about the situation with visa extensions and access to financial aid. My friends and I have been trying to get visa extensions for several months now, but all our attempts have been rejected. We need help with preparing documents and appealing to the relevant authorities. We also need financial assistance to cover our living expenses and accommodation. Can you help us with this problem? Do you know about any programs or organizations that can help Ukrainian students in this situation?"}
{"tag":"travelling abroad","message_eng":"I'm facing difficulties in replacing my lost passport at the border crossing between Finland and Russia. After checking my documents, the customs officer told me that I need to return to Ukraine to get a new passport. But I cannot return to Ukraine as the war is ongoing and my life is at risk. I've been living in Finland for several months, working and paying rent, but without a passport I'm being refused registration and assistance. I'm asking for help in replacing my lost passport or obtaining a special permit to stay in Finland."}
{"tag":"unemployment support","message_eng":"I'm having trouble registering as unemployed in Finland. As a freelance professional, I lost my job due to the war, which changed the global market situation. Now it's hard for me to find a new job, as many companies have stopped their operations or reduced staff. I need help with registering in the unemployment system and getting assistance. I've tried to submit my application several times, but I'm rejected, saying I need to provide additional documents or visit a special center. But I've already completed all the necessary documents and visited the center several times. I'm very worried about my financial situation and future. Please help me find a solution to this problem."}
{"tag":"unpaid bills","message_eng":"I'm writing from Ukraine, where I've stayed since the war. My husband left the country and stopped sending child support payments. Since then, I've accumulated €5,000 in credit card debt, as I had to take loans to provide for myself and my child's food and housing. It's crucial for me to get help to pay off my debt and secure my child's future. Can you help me get financial assistance or advise on how to pay off my debt?"}
{"tag":"unpaid bills","message_eng":"I'm facing a problem with receiving payment from a Finnish client. He promised me €10,000 for the work I did as a freelancer, but for several months now I haven't received any response to my messages. I need help with this issue as I need to secure my future and support my family who is still in Ukraine. Can you possibly help me get in touch with this client or even assist me in getting the payment?"}
{"tag":"visa issues","message_eng":"I'm writing from Ukraine, but I'm currently in Finland. My residence permit was revoked because I failed to notify the authorities of a change in my address. After that, I was served with a deportation order, but I couldn't attend the scheduled hearing due to lack of funds for the trip. Now I'm facing deportation. I'm very scared to return to Ukraine, as I'm no longer able to live there. I need help in reinstating my residence permit or obtaining another form of protection. I'm begging for help."}
{"tag":"work","message_eng":"I'm facing difficulties with my employer after they offered me a contract change proposal. They're requiring me to sign a new contract with more responsibilities, but without an increase in salary. I need to change my contract to continue working for the company, but they refuse to change the terms. I've already approached them several times, but they refuse to listen to me. I'm very concerned about this situation, as I need to secure my future and that of my family. I'm seeking help in resolving this issue."}
